[
  {
    "date": "2024-07-05T11:00:00Z",
    "title": "Update 4.8: Universal search",
    "message": "This feature allows you to search for any transaction, category, income, saving, or month quickly to view or edit it. From the home screen > go to history > scroll down to activate the search bar, and SEARCH!"
  },
  {
    "date": "2024-07-03T08:00:00Z",
    "title": "Changes to Ads",
    "message": "With update 4.7.2 this week, Money-Wise Plus users will not be seeing any ads anymore."
  },
  {
    "date": "2024-04-29T23:00:00Z",
    "title": "Update 4.7 is coming soon!",
    "message": "This update will bring improvements to notifications. If a user has been inactive for a prolonged period (between 3-7 days), we will send a reminder to get back to budget. You will be able to turn this off in Settings > Automatic options > Remind me to budget."
  },
  {
    "date": "2024-04-19T20:00:00Z",
    "title": "Update 4.6: Automatic options",
    "message": "This update allows you to do some automatic things like:\n\n1. **Auto-savings** to automatically add balance from a month to savings.\n\n2. Automatically **add all** the recurring items occurring in a month **at once**, instead of having them appear on the day of recurrence."
  },
  {
    "date": "2024-04-12T14:00:00Z",
    "title": "Update 4.5 is coming soon!",
    "message": "This update will bring **recurring incomes** that will allow you to add income for any duration (and not be limited to *1-month duration* like before).\n**Note**:\n1. Your previous incomes that are not marked as repeating will not repeat. If you would like them to repeat, edit your previous incomes to make them repeat for your specified duration.\n2. Your income can only be seen on/after the day it is intended to repeat. You will not see it before that day. You can go to Financial overview -> Repeating to see when it is going to repeat. "
  },
  {
    "date": "2024-03-28T19:01:00Z",
    "title": "Update 4.4 is coming soon!",
    "message": "Next week, you can expect the following inclusions and changes in this app:\n\n1. **Month-end wrap-up**: Once the month is over, you will see a summary of the past month (and how you budgeted) before you can start with the next month.\n\n2. **Income details** from a month are transferred to the next month. Previously, only the total income was passed to the next month.\n\n3. The **default transaction name** (if you do not enter a transaction name) will now be your location name (if you have given access to your location). \n\n4. New screen for adding an income.\n\n5. Financial overview in the Home Screen now includes transaction modes (“modes”) and recurring transactions (“Repeating”).\n\n6. **Interactive graphs** in the full report and category statistic screens. You can tap on a point on a graph to see its value.\n\n7. Tap the category amount on the Home Screen to **toggle** between seeing the **amount** or the **percentage** of your total expense. \n\n8. Minor refreshment to the category-wise statistics screen.\n\n9. Removal of the option to change app icons.\n\n10. Bug fixes and performance enhancement."
  },
  {
      "date": "2024-03-16T17:30:00Z",
      "title": "Update 4.3: Transaction modes and Ads",
      "message": "There is an easier way to add more **modes** (like debit and credit cards). When entering a transaction, tap on the transaction mode menu to see the list of modes. At the bottom of this list, you will see an option to add more transaction modes.\n\nThis update also improves the experience of **editing** a transaction.\n\nFinally, this update incorporates **ads** designed not to disrupt your app usage experience."
    },
  {
      "date": "2024-03-14T17:30:00Z",
      "title": "Update 4.2: Transaction Activity",
      "message": "Now you can add a transaction as a **“credit”** in addition to the existing **“expense”** for a category.\n\nThis is useful for keeping track of *refunds or cash back* that have been made to you."
    },
  {
      "date": "2024-03-09T17:30:00Z",
      "title": "Hello",
      "message": "This is a **new feature** that allows me to share information about promotions, new feature updates, bug avoidance, and other information directly to you. "
    }
]
