[
    {
      "id": 1,
      "title": "Currency converter",
      "subtitle": "Make transactions in other currencies. It automatically converts it to your default currency by using the daily conversion rate.",
      "imageName": "arrow.left.arrow.right.circle.fill"
    },
    {
      "id": 2,
      "title": "Reports",
      "subtitle": "Get monthly and all time diagnostic reports for all your past transactions. With pretty and informative graphs, it helps you to understand your spending habits, and how you could stay on your budget.",
      "imageName": "chart.bar.doc.horizontal.fill"
    },
    {
      "id": 3,
      "title": "Category reports",
      "subtitle": "Get statistics of all your past transactions in a category. This helps you identify your spending in a category. Use the in-built filters to make the most of it.",
      "imageName": "chart.bar.xaxis"
    },
    {
      "id": 4,
      "title": "Monthly Wrap-up",
      "subtitle": "Get a summary of your finance every month, before you start the next month.",
      "imageName": "doc.fill"
    },
    {
      "id": 5,
      "title": "Unlimited categories",
      "subtitle": "Add as many categories as you want with unlimited customizations! There is literally no limit.",
      "imageName": "number"
    },
    {
      "id": 6,
      "title": "Customizations",
      "subtitle": "Add custom transaction modes when adding a transaction. These help you filter out your expenses. Also select a different app icon from the setting.",
      "imageName": "rectangle.grid.2x2.fill"
    },
    {
      "id": 7,
      "title": "Add & Edit History",
      "subtitle": "Add transaction you forgot to add in previous months' or edit a mistake from previous month.",
      "imageName": "scribble"
    },
    {
      "id": 8,
      "title": "Maps",
      "subtitle": "Map all your transactions in category and full reports to see where you spend your money.",
      "imageName": "mappin.and.ellipse"
    },
    {
      "id": 9,
      "title": "Export as CSV",
      "subtitle": "Export all your data to a CSV format with easy.",
      "imageName": "square.and.arrow.up"
    },
    {
      "id": 10,
      "title": "Future updates",
      "subtitle": "Get all the exciting new updates and features with Money-Wise Plus. You do not need to pay on this app ever again!",
      "imageName": "clock"
    }
  ]
